In [1]:
people = {
    "first":["Corey","Jane","John"],
    "last":["Schafer","Doe","Doe"],
    "email":["CoreyMSchafer@gmail.com","JaneDoe@email.com","JohnDoe@gmail.com"]
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@gmail.com

In [6]:
# check the columns

df.columns

Index(['first', 'last', 'email'], dtype='object')

In [7]:
# rename the column
# use the column attribute
df.columns = ['first_name','last_name','email']

In [8]:
df.columns

Index(['first_name', 'last_name', 'email'], dtype='object')

In [9]:
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@gmail.com

In [10]:
# make the column names in UPPER CASE
# now all columns are translated to upper case

df.columns = [x.upper() for x in df.columns]
df

  FIRST_NAME LAST_NAME                    EMAIL
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@gmail.com

In [12]:
# if you wanted to replace spaces on column labels with underscore
# from FIRST NAME to FIRST_NAME

df.columns = df.columns.str.replace(' ','_')
df

  FIRST_NAME LAST_NAME                    EMAIL
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@gmail.com

In [13]:
# make the column names in lower case
# now all columns are translated to upper case

df.columns = [x.lower() for x in df.columns]
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@gmail.com

In [15]:
# what if we wanted to change some columns?
# use the rename method
# pass in a dictionary for the column that we want to change
# the key would be the old value, the value would be the new value


df.rename(columns = {'first_name':'first','last_name':'last'})

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@gmail.com

In [17]:
# but this will not be permanent since there is no inplace = True
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@gmail.com

In [19]:
# to make it permanent
# put inplace = True

df.rename(columns = {'first_name':'first','last_name':'last'}, inplace = True)

In [20]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@gmail.com

In [23]:
# how to update single value
# change john doe to john smith
# grab first John Doe row

df.loc[2]

first                 John
last                   Doe
email    JohnDoe@gmail.com
Name: 2, dtype: object

In [24]:
# change the row to John Smith and email to JohnSmith@email.com

df.loc[2] = ['John','Smith','JohnSmith@email.com']

In [27]:
# John Doe information has been replaced

df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith      JohnSmith@email.com

In [28]:
# what if you have 85 columns?
# how to extract john smith last name and email address

df.loc[2,['last','email']]

last                   Smith
email    JohnSmith@email.com
Name: 2, dtype: object

In [29]:
# return it to origina detail of John Doe

df.loc[2,['last','email']] = ['Doe','JohnDoe@email.com']

In [31]:
# now it's back
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [32]:
# change one value only from Doe to Smith

df.loc[2,'last'] = 'Smith'

In [38]:
# now changed to Smith
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [39]:
# can also use dot @
# search why we use .at but prefer to use .loc
# .at is similar to .loc based on documentation

df.at[2,'last'] = 'Doe'

In [40]:
# returns to Doe
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [41]:
# one mistake that is very common
# changing one value without any index
# let's say we have large dataframe where we want to find this John Doe person
# and change its lastname to Smith
# one way we can do this is to use a filter to grab that specific row

filt = (df['email']== 'JohnDoe@email.com')

# apply this filter to the dataframe and run it
# we can see that it shows the correct data

df[filt]

  first last              email
2  John  Doe  JohnDoe@email.com

In [43]:
# access the last name from that filter

df[filt]['last']

2    Doe
Name: last, dtype: object

In [45]:
# you might think that we could change the last name by
# simply using below:

df[filt]['last']='Smith'

# but it gives you a warning - setting with copy warning
# we don't actually make that change to our data frame
# the reason is: it requires multiple operation in the background
#

/var/folders/_c/7_nlp2l53sbcnpz463hcc70w0000gn/T/ipykernel_1975/429119179.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[filt]['last']='Smith'

In [46]:
# do this instead

df.loc[filt,'last'] = 'Smith'

In [48]:
# now it is already changed

df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith        JohnDoe@email.com

In [49]:
# change email addresses to lower case
# assign that column to the lowercase value of itself
# grab the lowercase value

df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith        JohnDoe@email.com

In [51]:
# convert to lower case

df['email'].str.lower()

0    coreymschafer@gmail.com
1          janedoe@email.com
2          johndoe@email.com
Name: email, dtype: object

In [52]:
# to make that change
# assign that column to that converted email 

df['email'] = df['email'].str.lower()

In [53]:
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John    Smith        johndoe@email.com

In [54]:
# another way to do it is
# a lot of people get this method confused
# apply, map, applymap, replace

# apply is used for calling our function on our values
# this can work on data frame or a series objects

In [55]:
# use apply on a series
# it can apply function to every value in our series

df['email'].apply(len)

0    23
1    17
2    17
Name: email, dtype: int64

In [56]:
# create function that returns the uppercase version of our email

def update_email(email):
    return email.upper()

In [57]:
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John    Smith        johndoe@email.com

In [58]:
# this actually doesn't change our dataframe yet

df['email'].apply(update_email)

0    COREYMSCHAFER@GMAIL.COM
1          JANEDOE@EMAIL.COM
2          JOHNDOE@EMAIL.COM
Name: email, dtype: object

In [59]:
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John    Smith        johndoe@email.com

In [60]:
df['email'] = df['email'].apply(update_email)

In [62]:
# now email address is in uppercase
df

   first     last                    email
0  Corey  Schafer  COREYMSCHAFER@GMAIL.COM
1   Jane      Doe        JANEDOE@EMAIL.COM
2   John    Smith        JOHNDOE@EMAIL.COM

In [64]:
# convert it to lowercase
# pass a lambda function

df['email'] = df['email'].apply(lambda x: x.lower())

In [65]:
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John    Smith        johndoe@email.com

In [67]:
# let's check how apply works on dataframe
# this gives us length

df['email'].apply(len)

0    23
1    17
2    17
Name: email, dtype: int64

In [68]:
# instead of accessing df.columns
# let's just say

df.apply(len)

first    3
last     3
email    3
dtype: int64

In [71]:
# our first name column has length of 3, and so on
# access the length of email column

len(df['email'])

3

In [73]:
# can put also axis, default axis is rows

df.apply(len, axis ='columns')

0    3
1    3
2    3
dtype: int64

In [79]:
# now we get three columns (first, last, email)
# let's say that we wanted to grab the minimum value for each column
# use apply
# Series must be capital S for it to run
# but this one is applicable to numerical data
# can also use lambda function but for series objects only

df.apply(pd.Series.min)

first                      Corey
last                         Doe
email    coreymschafer@gmail.com
dtype: object

In [82]:
# same result
# this is good for numerical analysis

df.apply(lambda x: x.min())

first                      Corey
last                         Doe
email    coreymschafer@gmail.com
dtype: object

In [83]:
# applymap
# len function is applied to each column
# 

df.applymap(len)

   first  last  email
0      5     7     23
1      4     3     17
2      4     5     17

In [84]:
# if you have numerical data you will get an error
df.applymap(str.lower)

   first     last                    email
0  corey  schafer  coreymschafer@gmail.com
1   jane      doe        janedoe@email.com
2   john    smith        johndoe@email.com

In [86]:
# map is used for substituting a value for another value
# key is the old value and value is the new value
# the value what we did not substitute is converted to NaN

df['first'].map({'Corey':'Chris','Jane':'Mary'})

0    Chris
1     Mary
2      NaN
Name: first, dtype: object

In [88]:
# so instead of doing map, use the replace method
# so unreplaced value is retained (John)
df['first'].replace({'Corey':'Chris','Jane':'Mary'})

0    Chris
1     Mary
2     John
Name: first, dtype: object

In [89]:
# set this to a column
df['first'] = df['first'].replace({'Corey':'Chris','Jane':'Mary'})

In [90]:
df

   first     last                    email
0  Chris  Schafer  coreymschafer@gmail.com
1   Mary      Doe        janedoe@email.com
2   John    Smith        johndoe@email.com

In [91]:
df = pd.read_csv('/Users/jean110284/Desktop/Everything/MJUPython/survey_results_public.csv',index_col='ResponseId')
schema_df = pd.read_csv('/Users/jean110284/Desktop/Everything/MJUPython/survey_results_schema.csv',index_col='qid')

In [92]:
pd.set_option('display.max_columns',85)
pd.set_option('display.max_rows',85)

In [93]:
df.head(2)

,MainBranch,Employment,Country,US_State,UK_Country,EdLevel,Age1stCode,LearnCode,YearsCode,YearsCodePro,DevType,OrgSize,Currency,CompTotal,CompFreq,LanguageHaveWorkedWith,LanguageWantToWorkWith,DatabaseHaveWorkedWith,DatabaseWantToWorkWith,PlatformHaveWorkedWith,PlatformWantToWorkWith,WebframeHaveWorkedWith,WebframeWantToWorkWith,MiscTechHaveWorkedWith,MiscTechWantToWorkWith,ToolsTechHaveWorkedWith,ToolsTechWantToWorkWith,NEWCollabToolsHaveWorkedWith,NEWCollabToolsWantToWorkWith,OpSys,NEWStuck,NEWSOSites,SOVisitFreq,SOAccount,SOPartFreq,SOComm,NEWOtherComms,Age,Gender,Trans,Sexuality,Ethnicity,Accessibility,MentalHealth,SurveyLength,SurveyEase,ConvertedCompYearly
ResponseId,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
1,I am a developer by profession,"Independent contractor, freelancer, or self-em...",Slovakia,NaN,NaN,"Secondary school (e.g. American high school, G...",18 - 24 years,Coding Bootcamp;Other online resources (ex: vi...,NaN,NaN,"Developer, mobile",20 to 99 employees,EUR European Euro,4800.0,Monthly,C++;HTML/CSS;JavaScript;Objective-C;PHP;Swift,Swift,PostgreSQL;SQLite,SQLite,NaN,NaN,Laravel;Symfony,NaN,NaN,NaN,NaN,NaN,PHPStorm;Xcode,Atom;Xcode,MacOS,Call a coworker or friend;Visit Stack Overflow...,Stack Overflow,Multiple times per day,Yes,A few times per month or weekly,"Yes, definitely",No,25-34 years old,Man,No,Straight / Heterosexual,White or of European descent,None of the above,None of the above,Appropriate in length,Easy,62268.0
2,I am a student who is learning to code,"Student, full-time",Netherlands,NaN,NaN,"Bachelors degree (B.A., B.S., B.Eng., etc.)",11 - 17 years,"Other online resources (ex: videos, blogs, etc...",7,NaN,NaN,NaN,NaN,NaN,NaN,JavaScript;Python,NaN,PostgreSQL,NaN,NaN,NaN,Angular;Flask;Vue.js,NaN,Cordova,NaN,Docker;Git;Yarn,Git,Android Studio;IntelliJ;Notepad++;PyCharm,NaN,Windows,Visit Stack Overflow;Google it,Stack Overflow,Daily or almost daily,Yes,Daily or almost daily,"Yes, definitely",No,18-24 years old,Man,No,Straight / Heterosexual,White or of European descent,None of the above,None of the above,Appropriate in length,Easy,NaN

In [96]:
# change the ConvertedCompYearly to SalaryUSD

df.rename(columns={'ConvertedCompYearly':'SalaryUSD'},inplace = True)

In [97]:
df.head(2)

,MainBranch,Employment,Country,US_State,UK_Country,EdLevel,Age1stCode,LearnCode,YearsCode,YearsCodePro,DevType,OrgSize,Currency,CompTotal,CompFreq,LanguageHaveWorkedWith,LanguageWantToWorkWith,DatabaseHaveWorkedWith,DatabaseWantToWorkWith,PlatformHaveWorkedWith,PlatformWantToWorkWith,WebframeHaveWorkedWith,WebframeWantToWorkWith,MiscTechHaveWorkedWith,MiscTechWantToWorkWith,ToolsTechHaveWorkedWith,ToolsTechWantToWorkWith,NEWCollabToolsHaveWorkedWith,NEWCollabToolsWantToWorkWith,OpSys,NEWStuck,NEWSOSites,SOVisitFreq,SOAccount,SOPartFreq,SOComm,NEWOtherComms,Age,Gender,Trans,Sexuality,Ethnicity,Accessibility,MentalHealth,SurveyLength,SurveyEase,SalaryUSD
ResponseId,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
1,I am a developer by profession,"Independent contractor, freelancer, or self-em...",Slovakia,NaN,NaN,"Secondary school (e.g. American high school, G...",18 - 24 years,Coding Bootcamp;Other online resources (ex: vi...,NaN,NaN,"Developer, mobile",20 to 99 employees,EUR European Euro,4800.0,Monthly,C++;HTML/CSS;JavaScript;Objective-C;PHP;Swift,Swift,PostgreSQL;SQLite,SQLite,NaN,NaN,Laravel;Symfony,NaN,NaN,NaN,NaN,NaN,PHPStorm;Xcode,Atom;Xcode,MacOS,Call a coworker or friend;Visit Stack Overflow...,Stack Overflow,Multiple times per day,Yes,A few times per month or weekly,"Yes, definitely",No,25-34 years old,Man,No,Straight / Heterosexual,White or of European descent,None of the above,None of the above,Appropriate in length,Easy,62268.0
2,I am a student who is learning to code,"Student, full-time",Netherlands,NaN,NaN,"Bachelors degree (B.A., B.S., B.Eng., etc.)",11 - 17 years,"Other online resources (ex: videos, blogs, etc...",7,NaN,NaN,NaN,NaN,NaN,NaN,JavaScript;Python,NaN,PostgreSQL,NaN,NaN,NaN,Angular;Flask;Vue.js,NaN,Cordova,NaN,Docker;Git;Yarn,Git,Android Studio;IntelliJ;Notepad++;PyCharm,NaN,Windows,Visit Stack Overflow;Google it,Stack Overflow,Daily or almost daily,Yes,Daily or almost daily,"Yes, definitely",No,18-24 years old,Man,No,Straight / Heterosexual,White or of European descent,None of the above,None of the above,Appropriate in length,Easy,NaN

In [99]:
df['SOAccount']

ResponseId
1        Yes
2        Yes
3        Yes
4        Yes
5        Yes
        ...
83435     No
83436    Yes
83437    Yes
83438    Yes
83439    Yes
Name: SOAccount, Length: 83439, dtype: object

In [106]:
# be careful when using map as it will convert all no values to NaN

df['SOAccount'].map({'Yes':True,'No':False} )

ResponseId
1         True
2         True
3         True
4         True
5         True
         ...
83435    False
83436     True
83437     True
83438     True
83439     True
Name: SOAccount, Length: 83439, dtype: object

In [107]:
# use the replace method instead

df['SOAccount'].replace({'Yes':True,'No':False} )

ResponseId
1         True
2         True
3         True
4         True
5         True
         ...
83435    False
83436     True
83437     True
83438     True
83439     True
Name: SOAccount, Length: 83439, dtype: object

In [108]:
# END JUNE 24, 2022 1:54 P.M